<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>JColtrane - Home</title>
<style type="text/css">
<!--
.style6 {font-size: 18px}
.style7 {
	font-size: 36px;
	color: #000000;
}
.style8 {
	font-size: 24px;
	color: #0033FF;
}
.style9 {font-size: 18px; color: #000000; }
body,td,th {
	font-family: Verdana, Arial, Helvetica, sans-serif;
}
.style10 {font-size: 30px}
.style11 {font-size: 24px; color: #000000; }
-->
</style>
</head>

<body>
<table width="100%" border="5" bordercolor="#000000">
  <tr>
    <th bgcolor="#FFFFFF" scope="col"><p>Change Language: <img src="estados_unidos.gif" width="43" height="23" border="0" usemap="#Map" /></p>
      <p><img src="SAX.jpg" width="374" height="170" /></p>
      <p><span class="style7"><strong>JColtrane</strong> - melhor que o SAX sozinho </span></p>
    <p><a href="http://sourceforge.net/project/showfiles.php?group_id=233687">Download</a> - <a href="http://sourceforge.net/forum/?group_id=233687">F&oacute;rum</a></p></th>
  </tr>
</table>
<table width="100%" border="5" cellpadding="0" cellspacing="0" bordercolor="#000000">
  <tr bordercolor="#FFFFFF">
    <th scope="col"><div align="left">
      <blockquote>
        <p class="style8">&nbsp;</p>
        <table width="100%" border="0" cellpadding="0" cellspacing="0" bordercolor="#FFFFFF">
          <tr>
            <td width="10%"><img src="New.jpg" width="90" height="85" /></td>
            <td width="90%"><div align="center"><a href="http://xmlchallenge.com/winnerscircle" class="style10">JColtrane ganha o concurso &quot;XML Challenge&quot; promovido pela IBM e IDUG </a></div></td>
          </tr>
        </table>
        <p class="style8">&nbsp;</p>
        <p class="style11">Introdu&ccedil;&atilde;o</p>
        <p align="justify" class="style9"><span class="style6">JColtrane &eacute; um framework que usa o SAX do JAVA, de forma transparente, para analisar documentos xml de forma f&aacute;cil. </span></p>
        <p align="justify" class="style9">O nome do framework &eacute; uma homenagem a John Coltrane, um famoso saxofonista que muitos definem como: &quot;melhor que o sax sozinho&quot;. </p>
        <p align="justify" class="style9">Se voc&ecirc; alguma vez trabalhou com o  SAX, provavelmente se perguntou uma ou mais das quest&otilde;es abaixo:</p>
        <ul>
          <li>Por que o SAX n&atilde;o apresenta algumas condi&ccedil;&otilde;es padr&atilde;o, me fornecendo uma uma maneira f&aacute;cil para criar as minhas pr&oacute;prias condi&ccedil;&otilde;es, fazendo com que eu n&atilde;o precise codificar v&aacute;rios e entediantes blocos if/elses e, portanto, tornando a manuten&ccedil;&atilde;o mais simples? </li>
          
          <li> Por que o SAX n&atilde;o mantem algumas informa&ccedil;&otilde;es sobre elementos passados para me ajudar, me economizando trabalho e tempo?</li>
          <li> Por que, quando se usa o SAX, tenho que extender uma classe (DefaultHandler), implementando m&eacute;todos com v&aacute;rios par&acirc;metros,uma vez que eu n&atilde;o preciso de todos eles, ou n&atilde;o preciso de todos os m&eacute;todos implementados?</li>
          <li> Como fa&ccedil;o um processo de an&aacute;lise XML extens&iacute;vel?</li>
        </ul>
        <p class="style9">O prop&oacute;sito do  JColtrane &eacute; responder &agrave;s quest&otilde;es anteriores, construindo solu&ccedil;&otilde;es para permitir aos usu&aacute;rios produzir c&oacute;digo JAVA limpo, extens&iacute;vel e f&aacute;cil de manter quando estiver analisando algum documento XML. Existem dois tutoriais:</p>
        <ol>
          <li><a href="userguide_pt/conhecimeto_previo_necessario.html">Guia do Usuário</a><a href="userguide/necessary_previous_knowledge.html"></a><a href="userguide/introduction.html"></a></li>
          <li>Como JColtrane Funciona </li>
          </ol>
        <p><span class="style9"><em>Guia do Usu&aacute;rio </em> &eacute; destinado &agrave; usu&aacute;rios que desejam usar o JColtrane em alguma aplica&ccedil;&atilde;o. <em>Como JColtrane Funciona </em> &eacute; destinado a pessoas que desejam conhecer mais sobre o c&oacute;digo fonte e talvez fazer algumas altera&ccedil;&otilde;es. Para entender  <em>Como JColtranane Funciona</em>, n&atilde;o &eacute; necessario ler o <em>Guia do Usu&aacute;rio</em> previamente, mas, para a maioria das pessoas, agir dessa forma &eacute; o jeito mais f&aacute;cil para um entendimento completo. A escolha &eacute; sua! </span><br class="style9" align="justify" />
        </p>
      </blockquote>
    </div></th>
  </tr>
</table>
<p>&nbsp;</p>
<p>&nbsp;</p>

<map name="Map" id="Map"><area shape="rect" coords="1,0,52,28" href="index.html" />
</map></body>

</html>
